---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOutsideWillBeRedependent
source: html/d9e1e49b-89ee-d0c8-8036-43d5e43138d8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOutsideWillBeRedependent Property

Type associated curtain grid lines outside of the edited wall boundaries will be made dependent again in order that they remain on the wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridlinesOutsideWillBeRedependent { get; }
```